api/app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Example User', 'user@example.com', '$2a$04$Pb/hxK4KnqtnTxfZD/892OKkRm6NBpbn9PkVujLs3zb1iaaVw8Sbi', '2022-08-30 13:47:19.769524', '2022-08-30 13:47:19.769524')
---
  def create
    user = User.find_by(email: user_params[:email].downcase)
    if user
      render json: { status: 400, message: 'このメールアドレスは既に使われています' } if user
    else
      user = User.new(user_params)
      if user.save!